Autodesk.Revit.UI.Events.BeforeExecutedEventArgs.UsingCommandData
Indicates whether or not the Revit journal will include custom data populated by the application associated with this command.
Remarks:
For details about the use of journal data associated to a command, see Autodesk.Revit.UI.ExternalCommandData.JournalData.
The default value is false.
Since: 2017

Autodesk.Revit.UI.Events.BeforeExecutedEventArgs
The event arguments used by AddInCommandBinding's BeforeExecuted event.
Remarks:
This event is cancellable. If your callback sets the Cancel property to true, the command will not execute.
Since: 2014